Autodesk.Revit.DB.Structure.RebarShapeVertexTurn
Specify whether a bend at a RebarShapeVertex represents a left or right turn.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeVertexTurn.Default
The turn value has not yet been set, or will not be used.

Autodesk.Revit.DB.Structure.RebarShapeVertexTurn.Right
A right turn.

Autodesk.Revit.DB.Structure.RebarShapeVertexTurn.Left
A left turn.